alairjunior/HalfKOS/src/ports/MSP430G2553LP/hkos_arch_hal.c
    if ( is_valid_pin( pin ) )
    {
        pin_is_io( pin );

        switch( mode )
        {
            case INPUT:
                pin_is_input( pin );
                pin_disable_resistor( pin );
                break;

            case INPUT_PULLUP:
                pin_is_input( pin );
                pin_enable_pullup( pin );
                break;

            case INPUT_PULLDOWN:
                pin_is_input( pin );
                pin_enable_pulldown( pin );
                break;

            case OUTPUT:
                pin_is_output( pin );
                pin_disable_resistor( pin );
                break;

        }
    }
}

/******************************************************************************
 * Write a value to a GPIO pin
 *
 * This function write a value to the provided GPIO pin. It will not change
 * the pin mode.
 *
 * @param[in]   pin     pin number
 * @param[in]   value   the value selected from the pin value enumeration
 *
 *****************************************************************************/
void hkos_hal_gpio_write( uint8_t pin, gpio_value_t value ) {
    if ( is_valid_pin( pin ) ) {

        const uint8_t port = pin_get_port( pin );
        const uint8_t bit_mask = pin_get_mask( pin );

        switch ( value ) {
            case HIGH:
                *GPIO_PXOUT[port] |=  bit_mask;
                break;

            case LOW:
                *GPIO_PXOUT[port] &= ~bit_mask;
                break;
        }
    }
}

/******************************************************************************
 * Read the value of a GPIO pin
 *
 * This function reads the value of the provided GPIO pin.
 *
 * @param[in]   pin     pin number
 *
 * @return  The value of the GPIO pin taken from the pin value enumeration
 *
 *****************************************************************************/
gpio_value_t hkos_hal_gpio_read( uint8_t pin ) {
    if ( is_valid_pin( pin ) ) {

        const uint8_t port = pin_get_port( pin );
        const uint8_t bit_mask = pin_get_mask( pin );

        if ( ( *GPIO_PXIN[port] & bit_mask ) != 0 )
        {
            return HIGH;
        } else {
            return LOW;
        }
    } else {
        return LOW;
    }
}

/******************************************************************************
 * Toggle the value of a GPIO pin
 *
 * This function toggles (switches) the value of the provided GPIO pin.
 * If pin is HIGH, it will become LOW, and vice-versa.
 *
 * @param[in]   pin     pin number
 *
 *****************************************************************************/
void hkos_hal_gpio_toggle( uint8_t pin ) {
    if ( hkos_hal_gpio_read( pin ) == HIGH )
        hkos_hal_gpio_write( pin, LOW );
    else
        hkos_hal_gpio_write( pin, HIGH );
}

/******************************************************************************
 * Initialize the task stack.
 *
 * MSP430G2553 has 12 GP registers (r4-r15). Also, when returning from an
 * interrupt, it pops the SR (r2) and PC (r0). So, we organized the stack
 * in such a way that when returning from the interrupt, all the data is
 * already in the proper places.
 *
 * @param[in]   pp_sp       a pointer to the stack pointer indicating the
 *                          memory region of the task stack
 * @param[in]   p_pc        a pointer to the beginning of the task code
 * @param[in]   stack_size  the size of the task's stack
 *
 * @return  The value of stack pointer after the stack initialization
 *
 *****************************************************************************/
void* hkos_hal_init_stack( void* p_sp, void* p_pc, hkos_size_t stack_size ){

    uint16_t* p_stack = (uint16_t*)p_sp;
    *--p_stack = (uint16_t)p_pc;
    *--p_stack = (uint16_t)GIE;
    *--p_stack = (uint16_t)0xFFFF; // R15
    *--p_stack = (uint16_t)0xEEEE; // R14
    *--p_stack = (uint16_t)0xDDDD; // R13
    *--p_stack = (uint16_t)0xCCCC; // R12
    *--p_stack = (uint16_t)0xBBBB; // R11
    *--p_stack = (uint16_t)0xAAAA; // R10
    *--p_stack = (uint16_t)0x9999; // R9
    *--p_stack = (uint16_t)0x8888; // R8
    *--p_stack = (uint16_t)0x7777; // R7
    *--p_stack = (uint16_t)0x6666; // R6
    *--p_stack = (uint16_t)0x5555; // R5
    *--p_stack = (uint16_t)0x4444; // R4


    // We paint the stack here so we can analyse stack usage.
    // to paint it, we include the context switch region too
    if ( HKOS_PAINT_TASK_STACK ) {
        stack_size += hkos_hal_get_min_stack_size();
        while ( (uint8_t*)p_stack > (uint8_t*)p_sp - stack_size ) {
            *--p_stack = HKOS_STACK_PAINT_VALUE;
        }
    }

    // When creating the task, the stack will hold the PC + SR + GP registers
    return (p_sp - hkos_hal_get_min_stack_size());
}


/******************************************************************************
 * Get the minimal stack size
 *
 * Depending on the CPU, the minimum stack size can be different. Besides the
 * task's user operations, the stack needs to be big enough to store data
 * during the context switch
 *
 * Minimum stack size on MSP430:
 *          + 2 Bytes for PC
 *          + 2 Bytes for SR
 *          + 12*2 Bytes for GP registers
 *
 *          = 28 bytes
 *
 *****************************************************************************/
inline hkos_size_t hkos_hal_get_min_stack_size( void ) {
    return 28; // better define it here than at the beginning of this file.
               // less mind jumps when analysing the code.
}


/******************************************************************************
 * Jump to the operating system
 *
 * This function will point the stack pointer to the operating system's stack
 * and start the timer to do the context switch operation. The interrupt to
 * handle the context switch must do the following operations:
 *
 *      1. Save the current task's context (stored in p_hkos_current_task)
 *      2. Call hkos_scheduler_switch
 *      3. Restore the new current task's context
 *
 *****************************************************************************/
void hkos_hal_jump_to_os( void ) {
    // We won't return from this call, so we can mess with
    // the stack pointer and registers freely

    // We paint the OS stack to help debug
    if ( HKOS_PAINT_TASK_STACK ) {
        for ( hkos_size_t i = 0; i < arraysize(hkos_ram.os_stack); i+=2 ) {
            *(uint16_t*)(&hkos_ram.os_stack[i]) = HKOS_STACK_PAINT_VALUE;
        }
    }

    // This will prepare the system to be in idle. This is essentially an
    // idle task but it was not included as a task to save a couple of bytes
    // of memory. The way it works is the following:
    //      1. We point the SP (R1) to the memory region reserved for the OS
    //      2. We push the hkos_idle lable position to the stack. This will
    //         be our PC when there is no other task to run
    //      3. We push the SR to the stack. In this case, SR will have LPM1
    //         bits set. This will make the CPU to turn off whenever the idle
    //         task is running. Each task has its own SR, so it will not affect
    //         other tasks. Idle task also have global interrupts enabled (GIE)
    //      4. We save back the idle task pointer to be restored when there is
    //         no tasks running
    //      5. We disable the interrupts so the idle task is not interrupted
    //         after starting the tick timer
    //      6. We start the tick timer (timer0A0) to start handling the context
    //         switch
    //      7. We simulate a return from interrupt, so PC and SR are restored,
    //         so idle task goes to its code position, we enter LPM1 state and
    //         global interrupts are enabled again.
    //
    asm volatile (
        "mov.w      %0,                  r1 \n\t" // Point r1 to the os stack
        "add.w      %1,                  r1 \n\t" // move r1 to the stack's end
        "push       #hkos_idle              \n\t" // push the idle PC
        "push       %3                      \n\t" // push SR with LPM1 enabled
        "mov.w      r1,                  %2 \n\t" // save the new os SP
        "bic.w      %4,                  r2 \n\t" // Disable interrupts
        "nop                                \n\t" // Required after dis. int.
        "call       #start_tick_timer       \n\t" // starts the tick timer
        "reti                               \n\t" // RETI will update PC and SR
    "hkos_idle:                             \n\t"
        "jmp        hkos_idle               \n\t" // when idle, we do nothing
        :
        : "i" (&hkos_ram.os_stack[0]), "i" (sizeof(hkos_ram.os_stack)),
                    "m" (p_hkos_sp), "i" (GIE+LPM1_bits), "i" (GIE)
        :
    );
}


