alairjunior/HalfKOS/src/ports/MSP430G2553LP/hkos_arch_hal.c
/******************************************************************************
 * TIMER0_A0 ISR. This is the HalfKOS tick timer
 *
 * This interrupt is responsible for context switch and perform the following
 * operations:
 *
 *      1. Save the current task's context (stored in hkos_ram.current_task)
 *      2. Call hkos_scheduler_switch
 *      3. Restore the new current task's context
 *
 *
 *****************************************************************************/
__attribute__((naked))
__attribute__((interrupt(TIMER0_A0_VECTOR)))
void timer_a0_isr(void) {
    asm volatile(
        "hkos_hal_save_context:             \n\t"
        "   cmp     #0, p_hkos_current_task \n\t" // is there current task?
        "   jz      done_save               \n\t" // if not, nothing to do
        "   push    r15                     \n\t" // push context to stack
        "   push    r14                     \n\t"
        "   push    r13                     \n\t"
        "   push    r12                     \n\t"
        "   push    r11                     \n\t"
        "   push    r10                     \n\t"
        "   push    r9                      \n\t"
        "   push    r8                      \n\t"
        "   push    r7                      \n\t"
        "   push    r6                      \n\t"
        "   push    r5                      \n\t"
        "   push    r4                      \n\t"
        "   mov.w   p_hkos_current_task, r15\n\t" // point to current task
        "   mov.w   r1,               0(r15)\n\t" // save the task SP
        "   jmp     done_save               \n\t"
        "done_save:                         \n\t"

        "   call #hkos_scheduler_switch     \n\t" // change current task

        "hkos_hal_restore_context:          \n\t"
        "   cmp     #0, p_hkos_current_task \n\t" // is there current task?
        "   jz      go_idle                 \n\t" // if not, switch to idle
        "   mov.w   p_hkos_current_task, r15\n\t" // otherwise, restore it
        "   mov.w   0(r15),               r1\n\t"
        "   pop     r4                      \n\t"
        "   pop     r5                      \n\t"
        "   pop     r6                      \n\t"
        "   pop     r7                      \n\t"
        "   pop     r8                      \n\t"
        "   pop     r9                      \n\t"
        "   pop     r10                     \n\t"
        "   pop     r11                     \n\t"
        "   pop     r12                     \n\t"
        "   pop     r13                     \n\t"
        "   pop     r14                     \n\t"
        "   pop     r15                     \n\t"
        "   jmp     done_restore            \n\t"
        "go_idle:                           \n\t"
        "   mov.w   p_hkos_sp,            r1\n\t"
        "done_restore:                      \n\t"
        "   reti                            \n\t"
    );
}

#endif // ARCH==MSP430G2553